[
  {
    "id": 92,
    "brand": "Adidas",
    "title": "BAPE x Adidas Forum 84 Legends Arcade",
    "date": "2023",
    "location": "END. Flagship Store, SoHo, London",
    "description": "Gamified experiential sneaker drop activation celebrating BAPE's 30th anniversary. Retro-futurism themed arcade wrapped in iconic blue ABC Camo pattern with neon lighting. Participants shoot hoops on branded arcade game to win limited-edition Forum 84' sneakers.",
    "activation": "Basketball arcade game with real-time leaderboard, shoot-to-win mechanic for sneakers and keychains, custom branded arcade tokens, immersive retro futurism design, physical alternative to online sneaker raffles, in-store hype generation.",
    "url": "https://checklandkindleysides.com/our-work/adidas-originals-bape-forum-gamified-retail-marketing-activation",
    "category": "footwear",
    "storeScope": "select",
    "promotionMethods": "Gamification, limited sneaker drops, END. UK exclusivity, BAPE camo branding, arcade nostalgia marketing, anti-bot physical experience"
  },
  {
    "id": 93,
    "brand": "Lululemon",
    "title": "Summer Run Club Series - Alpharetta",
    "date": "June 3 - August 19, 2024",
    "location": "Avalon, Alpharetta, GA",
    "description": "Six-week themed run club series partnering with The Hotel at Avalon and South City Kitchen. 45-minute coached runs on select Mondays covering Running 101, Injury Prevention, Goal Setting, Motivation, and Training Technique. Includes complimentary cocktails/mocktails and lululemon outfit giveaways.",
    "activation": "Weekly coached runs with Betsy Magato, themed educational workshops (6 topics), complimentary drinks on patio, lululemon outfit giveaways (3 weeks), injury prevention adjustments, meditation sessions, awards ceremony with perfect attendance staycation raffle.",
    "url": "https://www.awesomealpharetta.com/event/summer-run-club-series-powered-by-lululemon/2024-07-15/",
    "category": "apparel",
    "storeScope": "select",
    "promotionMethods": "Venue partnerships, run coach programming, themed educational content, outfit giveaways, complimentary refreshments, community building, perfect attendance incentives"
  },
  {
    "id": 94,
    "brand": "Patagonia",
    "title": "Worn Wear Snow Tour 2024 - Europe",
    "date": "Winter 2024 (Feb-March)",
    "location": "Europe (France, Italy, Germany, Austria, Switzerland, UK)",
    "description": "Mobile repair tour with two rolling repair shops visiting snow destinations including Chamonix, Innsbruck, Saalbach, Bormio, Trento, Montafon, Engelberg, and Andermatt. Offers free repairs on any brand of outdoor clothing - zippers, rips, tears, buttons. Hand-built wooden trailers with technical equipment, hot chocolate, and repair education.",
    "activation": "Free repairs on any brand (first-come-first-served), technical GORE-TEX repairs, repair education workshops teaching patching/waterproofing/zipper fixes, hand-crafted mobile trailers reaching remote locations, hot chocolate and community atmosphere, sustainability mission.",
    "url": "https://www.fall-line.co.uk/patagonia-worn-wear-tour/",
    "category": "apparel",
    "storeScope": "select",
    "promotionMethods": "Sustainability storytelling, free any-brand repairs, educational workshops, mobile touring, mountain resort partnerships, environmental mission marketing"
  },
  {
    "id": 95,
    "brand": "Nordstrom",
    "title": "Bode at The Corner - Flagship Pop-Up Series",
    "date": "March 14 - April 7, 2024",
    "location": "57th & Broadway, Nordstrom NYC Flagship",
    "description": "Launch of 'The Corner' - Nordstrom's 2,000 sq ft rotating pop-up series. First installation featuring Bode's men's and women's ready-to-wear, one-of-a-kind antique textile garments, hand-illustrated pieces. Opening event March 14 (6-8pm). Prices $198-2,200. Part of ongoing brand takeover series.",
    "activation": "Immersive brand-designed retail space, one-of-a-kind garment showcase, American craft tradition storytelling, opening cocktail event, authentic brand expression in Nordstrom flagship, first of rotating series (followed by Skims, Sanrio, Nike Running).",
    "url": "https://press.nordstrom.com/static-files/2377c5ba-b367-4a4f-8e4d-7e2fbfd235a4",
    "category": "apparel",
    "storeScope": "select",
    "promotionMethods": "Rotating brand takeovers, opening events, luxury positioning, exclusive one-of-a-kind pieces, NYC flagship destination, brand-designed spaces"
  }
]
