[
  {
    "id": 61,
    "brand": "Crocs",
    "title": "Icon Store SoHo Flagship",
    "date": "Summer 2025",
    "location": "543 Broadway, SoHo, New York",
    "description": "4,000-square-foot Icon Store featuring immersive storytelling, shopping events, and experiential theater for Crocs fans. Includes two customization counters with NYC-exclusive Jibbitz charms, bodega-inspired displays, premium 14K gold and Swarovski charms, and special event programming.",
    "activation": "Personalization focus with customization counters featuring NYC-exclusive Jibbitz charms, localized bodega experience, premium jewelry-level charms ($300+ options), artist drop-ins, TikTok livestreams, and Croctober seasonal activations.",
    "url": "https://www.modernretail.co/operations/crocss-new-retail-concept-blends-customization-community-and-a-broader-product-mix/",
    "category": "footwear",
    "storeScope": "select"
  },
  {
    "id": 62,
    "brand": "Vans",
    "title": "London Oxford Street Skateable Store",
    "date": "December 2024 - January 2025",
    "location": "Oxford Street, London",
    "description": "Revolutionary retail installation with 200-square-meter Roman travertine stone skate ramp designed by Andrea Caputo Studio. Features modular glass panels transforming between skate obstacle and retail display, celebrating skateboarding, music, and art culture.",
    "activation": "Fully skateable architectural installation with transformable ramp/display system, collaborations with The Great Frog jewelers, Gomi recycled speakers, Lovenskate artist decks, exclusive zines, and community cultural events.",
    "url": "https://hypebeast.com/2024/12/vans-off-the-wall-concept-skate-store-london",
    "category": "footwear",
    "storeScope": "select"
  },
  {
    "id": 63,
    "brand": "Vans",
    "title": "Downtown Los Angeles Community Store",
    "date": "February 2020",
    "location": "808 S. Broadway, Downtown Los Angeles",
    "description": "11,500-square-foot two-floor community-driven retail and event space paying homage to LA's skateboarding roots. Features mural by artist Geoff McFetridge and Studio808 on second floor offering free art and design workshops in partnership with Monster Children magazine.",
    "activation": "Studio808 community gallery, lounge and workshop space with hands-on art and design workshops free of charge, skate shop stocking LA brands (Alva, Baker, Girl, WKND), partnership with Goodwill and Chrysalis for workforce development, atmospheric skate photography.",
    "url": "https://wwd.com/feature/inside-vans-first-dtla-community-driven-retail-space-1203477932/",
    "category": "footwear",
    "storeScope": "select"
  },
  {
    "id": 64,
    "brand": "New Balance",
    "title": "Flatiron Flagship Remodel & Activation Series",
    "date": "2024",
    "location": "150 Fifth Avenue, New York",
    "description": "2,200-square-foot remodeled flagship featuring rotating three-month activations. Started with Grey Days celebrating signature color, transitioned to Found In New York series with In Bloom (Brooklyn artist CJ Hendry + Brooklyn Grange Farm) and Subway Series (five boroughs tribute).",
    "activation": "Open area consistently evolving with latest collaborations, events, launches and activations. Grey Days pop-up, In Bloom experiential art, Subway Series cultural tribute, and regular community partnerships with local creators.",
    "url": "https://wwd.com/footwear-news/shoe-industry-news/new-balance-flatiron-nyc-flagship-store-remodeled-1238145507/",
    "category": "footwear",
    "storeScope": "select"
  },
  {
    "id": 65,
    "brand": "H&M",
    "title": "Williamsburg Rotating Style Destination",
    "date": "November 2022 - January 2024",
    "location": "92 N. 6th Street, Williamsburg, Brooklyn",
    "description": "7,000-square-foot experimental store with rotating 'chapters' every 4-12 weeks featuring updated fashion, visuals, and local partnerships. Infrastructure over architecture design with plug-and-play retail system. First chapter celebrated Brasserie Hennes holiday campaign.",
    "activation": "Smart mirrors in fitting rooms with product identification and personalized styling recommendations, local Brooklyn brand partners (coffee station, magazine rack, music), rotating chapters (Brasserie Hennes, Move Studio), RFID inventory visibility, community-focused programming.",
    "url": "https://www.retaildive.com/news/hm-store-experience-Williamsburg-nyc/637331/",
    "category": "apparel",
    "storeScope": "select"
  },
  {
    "id": 66,
    "brand": "H&M",
    "title": "SoHo Pre-Loved Secondhand Concept",
    "date": "2024",
    "location": "SoHo, New York",
    "description": "New SoHo location featuring first-in-North-America Pre-Loved shop-in-shop for secondhand fashion. Elevated shopping experience showcasing most fashion-forward collection pieces merged with latest retail technology.",
    "activation": "Dedicated Pre-Loved secondhand shop-in-shop, elevated fashion curation, integrated retail technology for enhanced discovery, sustainability-focused shopping experience, and fashion-forward merchandising approach.",
    "url": "https://www.retaildive.com/news/hm-soho-secondhand-resale-store-concept/706659/",
    "category": "apparel",
    "storeScope": "select"
  },
  {
    "id": 67,
    "brand": "Madewell",
    "title": "SoHo Flagship with Denim Atelier",
    "date": "December 2024",
    "location": "565 Broadway, SoHo, New York",
    "description": "6,500-square-foot flagship with men's and women's collections. Features first-of-its-kind Denim Atelier for personalized fittings and social media-optimized space. Within ten-block radius, sidewalk stickers lead to museum-style installations in vacant storefronts.",
    "activation": "Denim Atelier booking appointments (individual or group) with specialized lighting and mirrors for social media photos, free drinks, personalized fitting services, sidewalk stickers and museum-style vacant storefront installations, immersive spring campaign integration.",
    "url": "https://wwd.com/business-news/retail/madewell-remakes-its-retail-experience-with-soho-flagship-launch-1236757578/",
    "category": "apparel",
    "storeScope": "select"
  },
  {
    "id": 68,
    "brand": "Alo Yoga",
    "title": "Mall of America Sanctuary Store",
    "date": "June 2025",
    "location": "Level 1 West, Mall of America, Bloomington, Minnesota",
    "description": "6,000-square-foot sanctuary concept store featuring full range of fashion-forward apparel for women, men, and unisex styles. Alo's second Minnesota location featuring studio-to-street performance wear, curated accessories, footwear, and wellness products.",
    "activation": "Sanctuary retail environment with signature studio-to-street performance wear crafted from proprietary fabrics, coordinated sets and loungewear, wellness product curation, community wellness programming, grand opening weekend activation (June 20-22).",
    "url": "https://mallofamerica.com/press-release/28313",
    "category": "apparel",
    "storeScope": "select"
  },
  {
    "id": 69,
    "brand": "Anthropologie",
    "title": "NYC Wedding Pop-Up with Pinterest",
    "date": "January-February 2024",
    "location": "New York City",
    "description": "Immersive wedding-themed pop-up showcasing Anthropologie Weddings bridal collection in partnership with Pinterest. Featured decor and lifestyle products from AnthroLiving and Terrain, open by appointment through February 4, 2024.",
    "activation": "Immersive wedding trend showcase, Pinterest trend integration, appointment-based exclusive access, cross-brand curation from URBN portfolio (AnthroLiving, Terrain), wedding registry experience, and personalized bridal consultation environment.",
    "url": "https://www.retailtouchpoints.com/topics/retail-store-design/experiential-retail/anthropologie-partners-with-pinterest-for-wedding-themed-pop-up-in-nyc",
    "category": "apparel",
    "storeScope": "select"
  },
  {
    "id": 70,
    "brand": "Anthropologie",
    "title": "Anthro Fruit Stand Pop-Ups",
    "date": "May 2024",
    "location": "The Grove (Los Angeles) & Union Square (NYC)",
    "description": "Experiential fruit stand-themed pop-ups linking in-person experiences with stores and digital presence. Featured on-site QR codes boosting category-specific DTC sales and AnthroPerks loyalty program registrations.",
    "activation": "Fruit stand themed installations with QR code integration for product discovery, DTC sales conversion, AnthroPerks loyalty registration, social media shareability, category-specific merchandising, and omnichannel customer acquisition.",
    "url": "https://www.retailtouchpoints.com/gallery/how-anthropologie-leverages-pop-ups-to-expand-its-role-as-customers-happy-place",
    "category": "apparel",
    "storeScope": "select"
  },
  {
    "id": 71,
    "brand": "Foot Locker",
    "title": "Store of the Future Concept - Willowbrook",
    "date": "April 24, 2024",
    "location": "Willowbrook Mall, Wayne, New Jersey",
    "description": "First 'Store of the Future' featuring bold storefront, expanded footwear and accessory selections, sustainability emphasis, dynamic digital fixtures. Concept to inspire 900 store redesigns in 2024-2025 as part of Lace Up Plan.",
    "activation": "Drop Zone for latest sneaker releases and trending products, communal try-on area, Sneaker Hub with specialized lacing and customization, enhanced women's section at front, high-tech toolkit for Striper sneaker ambassadors, intuitive shopping journey.",
    "url": "https://www.retaildive.com/news/foot-locker-store-of-the-future-concept/714129/",
    "category": "footwear",
    "storeScope": "select"
  },
  {
    "id": 72,
    "brand": "Sephora",
    "title": "North American Fleet Redesign",
    "date": "Fall 2024 - 2029",
    "location": "700+ stores across North America",
    "description": "Largest capital project in Sephora history redesigning entire North American fleet over five years. 111 stores already transformed with beauty studios repositioned, enhanced lighting for selfies, mobile checkout expansion, and category-focused layouts.",
    "activation": "Beauty studios with selfie-optimized lighting, mobile device checkout by staff, category organization (makeup, skin care, fragrance, hair care), enhanced customer flow, and stores outperforming controls in transactions, productivity, and sales.",
    "url": "https://www.retaildive.com/news/sephora-redesigns-stores-brick-and-mortar/737238/",
    "category": "beauty",
    "storeScope": "all"
  },
  {
    "id": 73,
    "brand": "CB2",
    "title": "Malibu Design Shop Concept",
    "date": "2023-2024",
    "location": "Malibu Country Mart, Malibu",
    "description": "2,250-square-foot showroom-style Design Shop, one-quarter the size of average CB2. Features exclusive few-of-a-kind furniture, vintage pieces, live plants, and little luxuries. Hosts CB2 Shop Talk programming with designer events and panel discussions.",
    "activation": "CB2 Shop Talk programming with designer meet and greets, design demonstrations, panel discussions with CB2 experts, trade member services, vintage furniture curation, live plant offerings, and creative hub for home inspiration.",
    "url": "https://www.homepagenews.com/retail-articles/cb2-design-shop-concept-takes-fresh-approach-to-interior-spaces/",
    "category": "home-goods",
    "storeScope": "select"
  },
  {
    "id": 74,
    "brand": "Vuori",
    "title": "SoHo & Flatiron NYC Flagship Expansion",
    "date": "October 2024",
    "location": "SoHo & Flatiron District, New York",
    "description": "Major NYC flagships at 5,000 sq ft (SoHo) and 4,500 sq ft (Flatiron) featuring California-inspired aesthetic with earthy materials. SoHo location emphasizes gender-neutral merchandising blending men's and women's fashions. Part of 20-25 stores/year expansion.",
    "activation": "California-inspired design (rock, soft quartz, concrete, washed oak, natural marble), gender-neutral merchandising approach, community connection spaces, flexible store formats, and brand experience emphasizing bringing people together.",
    "url": "https://www.modernretail.co/operations/in-quest-for-global-growth-vuori-opens-new-flagship-store-in-new-york-city/",
    "category": "apparel",
    "storeScope": "select"
  },
  {
    "id": 75,
    "brand": "On Running",
    "title": "Global Flagship Expansion",
    "date": "2024-2025",
    "location": "Multiple (Zurich, Tokyo Ginza, London, Chicago)",
    "description": "Signature metal box shoe display with products organized by activity (Lifestyle, Outdoor, Run). Zurich flagship at Limmatquai 28, Tokyo Ginza flagship with LightSpray technology showcase, London community-focused store, and Chicago location with 150+ SKUs.",
    "activation": "Individual metal box shoe displays for wow-factor, activity-based organization (Lifestyle/Outdoor/Run), On Labs technology showcases, community-focused design inspiring movement, intuitive product exploration with 150+ SKUs across models and colorways.",
    "url": "https://www.mcmillandoolittle.com/inside-on-runnings-newest-u-s-flagship/",
    "category": "footwear",
    "storeScope": "select"
  },
  {
    "id": 76,
    "brand": "REI",
    "title": "North Conway Experiential Service-Retail Concept",
    "date": "2020-2024",
    "location": "North Conway, New Hampshire",
    "description": "25,000-square-foot experiential concept at White Mountains entrance with one-third dedicated to communal space. Less focus on in-store product, more on experience, education, consultation, and community. First store located where members play, not where they live/work.",
    "activation": "Full third of space as experiential communal area, personalized outfitting appointments, local events and classes, outdoor-centered travel through REI Adventures, hiking/cycling/snowshoeing trips, fundamental shift toward experience over commerce.",
    "url": "https://www.iands.design/interior-design/article/10168159/this-new-rei-concept-is-the-next-evolution-in-experiential-retail",
    "category": "outdoor",
    "storeScope": "select"
  }
]
