{
  "metadata": {
    "version": "1.0.0",
    "createdAt": "2025-01-09T00:00:00Z",
    "lastUpdated": "2025-11-10T12:09:01.202Z",
    "totalEvents": 14,
    "targetEvents": 50,
    "footwearEvents": 4,
    "footwearPercentage": 29,
    "validationStatus": "completed",
    "notes": "Filtered to 7 true brand activations. Removed 18 store openings."
  },
  "events": [
    {
      "id": 22,
      "brand": "Apple",
      "title": "Today at Apple Creative Sessions Expansion",
      "date": "2023-2024",
      "location": "All Apple Stores nationwide",
      "description": "Expanded Today at Apple program offering free creative skills workshops, coding classes, and photography sessions in all retail locations.",
      "activation": "Stores host daily creative sessions including photo walks, music production workshops, coding classes for kids, and artist collaborations with local creators.",
      "url": "https://www.apple.com/today/",
      "category": "technology",
      "storeScope": "all",
      "promotionMethods": "Apple app promotions, email invitations, in-store signage, creator partnerships, community organization collaborations",
      "validationStatus": "alternative-url",
      "validatedAt": "2025-11-09T16:00:00Z",
      "assetInventory": {
        "hasLogo": true,
        "logoPath": "events/apple/event-22/logo.png",
        "promotionalImageCount": 0,
        "promotionalImages": [],
        "hasScreenshot": false,
        "screenshotPath": null,
        "hasCollage": true,
        "collagePath": "events/apple/event-22/slide-image.png",
        "metadataAvailable": true,
        "lastUpdated": "2025-11-09T16:16:10.629Z"
      },
      "imageInventory": {
        "totalImages": 1,
        "logoFirst": true,
        "images": [
          {
            "path": "events/apple/event-22/images/image-0.png",
            "order": 0,
            "isLogo": true
          }
        ]
      }
    },
    {
      "id": 57,
      "brand": "Nike",
      "title": "Urban Outfitters Nike On Rotation Experience",
      "date": "May 2024",
      "location": "Select Urban Outfitters stores",
      "description": "Immersive in-store Nike experience through Urban Outfitters' 'On Rotation' retail format, designed to fuel inspiration and discovery for Gen Z consumers with rotating Nike collections.",
      "activation": "Dedicated Nike sections with curated sneaker and apparel rotations, immersive brand storytelling, Gen Z-focused merchandising, integrated with Urban Outfitters' lifestyle aesthetic.",
      "url": "https://www.retailtouchpoints.com/features/news-briefs/urban-outfitters-launches-immersive-in-store-experience-with-nike",
      "category": "footwear",
      "storeScope": "select",
      "imageInventory": {
        "totalImages": 1,
        "logoFirst": true,
        "images": [
          {
            "path": "events/nike/event-57/images/image-0.png",
            "order": 0,
            "isLogo": true
          }
        ]
      }
    },
    {
      "id": 64,
      "brand": "New Balance",
      "title": "Flatiron Flagship Remodel & Activation Series",
      "date": "2024",
      "location": "150 Fifth Avenue, New York",
      "description": "2,200-square-foot remodeled flagship featuring rotating three-month activations. Started with Grey Days celebrating signature color, transitioned to Found In New York series with In Bloom (Brooklyn artist CJ Hendry + Brooklyn Grange Farm) and Subway Series (five boroughs tribute).",
      "activation": "Open area consistently evolving with latest collaborations, events, launches and activations. Grey Days pop-up, In Bloom experiential art, Subway Series cultural tribute, and regular community partnerships with local creators.",
      "url": "https://wwd.com/footwear-news/shoe-industry-news/new-balance-flatiron-nyc-flagship-store-remodeled-1238145507/",
      "category": "footwear",
      "storeScope": "select",
      "imageInventory": {
        "totalImages": 1,
        "logoFirst": true,
        "images": [
          {
            "path": "events/new-balance/event-64/images/image-0.png",
            "order": 0,
            "isLogo": true
          }
        ]
      }
    },
    {
      "id": 67,
      "brand": "Madewell",
      "title": "SoHo Flagship with Denim Atelier",
      "date": "December 2024",
      "location": "565 Broadway, SoHo, New York",
      "description": "6,500-square-foot flagship with men's and women's collections. Features first-of-its-kind Denim Atelier for personalized fittings and social media-optimized space. Within ten-block radius, sidewalk stickers lead to museum-style installations in vacant storefronts.",
      "activation": "Denim Atelier booking appointments (individual or group) with specialized lighting and mirrors for social media photos, free drinks, personalized fitting services, sidewalk stickers and museum-style vacant storefront installations, immersive spring campaign integration.",
      "url": "https://wwd.com/business-news/retail/madewell-remakes-its-retail-experience-with-soho-flagship-launch-1236757578/",
      "category": "apparel",
      "storeScope": "select",
      "imageInventory": {
        "totalImages": 1,
        "logoFirst": true,
        "images": [
          {
            "path": "events/madewell/event-67/images/image-0.png",
            "order": 0,
            "isLogo": true
          }
        ]
      }
    },
    {
      "id": 69,
      "brand": "Anthropologie",
      "title": "NYC Wedding Pop-Up with Pinterest",
      "date": "January-February 2024",
      "location": "New York City",
      "description": "Immersive wedding-themed pop-up showcasing Anthropologie Weddings bridal collection in partnership with Pinterest. Featured decor and lifestyle products from AnthroLiving and Terrain, open by appointment through February 4, 2024.",
      "activation": "Immersive wedding trend showcase, Pinterest trend integration, appointment-based exclusive access, cross-brand curation from URBN portfolio (AnthroLiving, Terrain), wedding registry experience, and personalized bridal consultation environment.",
      "url": "https://www.retailtouchpoints.com/topics/retail-store-design/experiential-retail/anthropologie-partners-with-pinterest-for-wedding-themed-pop-up-in-nyc",
      "category": "apparel",
      "storeScope": "select",
      "imageInventory": {
        "totalImages": 1,
        "logoFirst": true,
        "images": [
          {
            "path": "events/anthropologie/event-69/images/image-0.png",
            "order": 0,
            "isLogo": true
          }
        ]
      }
    },
    {
      "id": 73,
      "brand": "CB2",
      "title": "Malibu Design Shop Concept",
      "date": "2023-2024",
      "location": "Malibu Country Mart, Malibu",
      "description": "2,250-square-foot showroom-style Design Shop, one-quarter the size of average CB2. Features exclusive few-of-a-kind furniture, vintage pieces, live plants, and little luxuries. Hosts CB2 Shop Talk programming with designer events and panel discussions.",
      "activation": "CB2 Shop Talk programming with designer meet and greets, design demonstrations, panel discussions with CB2 experts, trade member services, vintage furniture curation, live plant offerings, and creative hub for home inspiration.",
      "url": "https://www.homepagenews.com/retail-articles/cb2-design-shop-concept-takes-fresh-approach-to-interior-spaces/",
      "category": "home-goods",
      "storeScope": "select",
      "imageInventory": {
        "totalImages": 1,
        "logoFirst": true,
        "images": [
          {
            "path": "events/cb2/event-73/images/image-0.png",
            "order": 0,
            "isLogo": true
          }
        ]
      }
    },
    {
      "id": 85,
      "brand": "Target",
      "title": "Warby Parker Shop-in-Shop Partnership",
      "date": "August 2024",
      "location": "Five locations (IL, MN, NJ, OH, PA)",
      "description": "Strategic partnership bringing Warby Parker shop-in-shops to five Target locations with full suite of products and services including glasses, sunglasses, contacts, eye exams, and vision tests. Staffed by Warby Parker employees with prices starting at $95 including prescription lenses.",
      "activation": "Dedicated Warby Parker sections within Target stores, full optical services including eye exams and vision tests, Warby Parker staff providing personalized service, integrated Target and Warby Parker brand experience, accessible eyewear at Target locations.",
      "url": "https://www.retaildive.com/news/target-warby-parker-shop-in-shops/741099/",
      "category": "general-retail",
      "storeScope": "select",
      "promotionMethods": "Grand opening events at each location, Target Circle member promotions, eye exam introductory offers, partnership co-marketing campaigns, local community vision health events",
      "imageInventory": {
        "totalImages": 1,
        "logoFirst": true,
        "images": [
          {
            "path": "events/target/event-85/images/image-0.png",
            "order": 0,
            "isLogo": true
          }
        ]
      }
    },
    {
      "id": 89,
      "brand": "Sephora",
      "title": "SEPHORiA 2024: Beauty Funhouse",
      "date": "September 27-28, 2024",
      "location": "Pullman Yards, Atlanta, GA",
      "description": "Large-scale experiential beauty festival with 50+ brand activations featuring Rare Beauty, Fenty Beauty, Glossier, Tatcha, Charlotte Tilbury. Multi-sensory Beauty Funhouse theme with masterclasses, brand founder access, and $500-1,300+ swag bags. 8,000 tickets sold across General Admission ($135) and VIP ($420) tiers.",
      "activation": "50+ visual and tactile brand booths, masterclasses with Mario Dedivanovic and brand founders, ice baths and stretching workshops, social media photo opportunities, surprise celebrity appearances, We Belong Campaign inclusivity programming, early VIP access with dedicated lounges.",
      "url": "https://newsroom.sephora.com/sephora-us-announces-new-theme-and-city-for-the-2024-sephoria-experience/",
      "category": "beauty",
      "storeScope": "select",
      "promotionMethods": "Social media campaigns, tiered ticketing with swag incentives, masterclass programming, brand founder appearances, influencer partnerships, Atlanta market introduction"
    },
    {
      "id": 90,
      "brand": "Nike",
      "title": "Nike Running @ The Corner - Nordstrom NYC Pop-Up",
      "date": "August 7 - September 2, 2025",
      "location": "57th & Broadway, Nordstrom NYC Flagship",
      "description": "Limited-time pop-up celebrating Nike innovation and running community. Features Nike Pegasus, Vomero, and Structure footwear lines, women's running apparel, accessories, and customization bar. Part of Nordstrom's ongoing 'The Corner' brand takeover series.",
      "activation": "Weekly Nike Morning Miles group runs (Fridays 7:30am), Nike Ready Set Go beginner sessions (Wednesdays 6:30pm), ice bath workshops with Ice-Cold Club founder, StretchLab stretching tutorials, styling appointments, customization services.",
      "url": "https://press.nordstrom.com/news-releases/news-release-details/nordstrom-ignites-nycs-running-scene-nike-running-corner",
      "category": "footwear",
      "storeScope": "select",
      "promotionMethods": "Community run programs, recovery workshops, Nike coach-led training, social running community engagement, Nordstrom partnership marketing"
    },
    {
      "id": 91,
      "brand": "Target",
      "title": "Diane von Furstenberg Pop-Up at The Shed",
      "date": "March 15-16, 2024",
      "location": "The Shed, 545 W 30th St, New York, NY",
      "description": "Pre-launch pop-up for Target x Diane von Furstenberg designer collaboration featuring 200+ pieces spanning women's, girls', and baby apparel, accessories, beauty, and home décor. Most items under $50, with made-to-order furniture from $300. Early access event before March 23 nationwide launch.",
      "activation": "Early shopping access to exclusive designer collaboration, VIP preview event March 14 (6-8pm), public shopping March 15-16, in-person experience of DVF aesthetic, limited-time designer partnership showcase, multigenerational collection with Talita von Furstenberg.",
      "url": "https://corporate.target.com/press/release/2024/02/target-announces-collaboration-with-diane-von-furstenberg-for-affordable-spring-collection",
      "category": "apparel",
      "storeScope": "select",
      "promotionMethods": "NYC pop-up preview event, VIP early access, press/influencer event, Target designer collaboration hype, limited-time scarcity marketing"
    },
    {
      "id": 92,
      "brand": "Adidas",
      "title": "BAPE x Adidas Forum 84 Legends Arcade",
      "date": "2023",
      "location": "END. Flagship Store, SoHo, London",
      "description": "Gamified experiential sneaker drop activation celebrating BAPE's 30th anniversary. Retro-futurism themed arcade wrapped in iconic blue ABC Camo pattern with neon lighting. Participants shoot hoops on branded arcade game to win limited-edition Forum 84' sneakers.",
      "activation": "Basketball arcade game with real-time leaderboard, shoot-to-win mechanic for sneakers and keychains, custom branded arcade tokens, immersive retro futurism design, physical alternative to online sneaker raffles, in-store hype generation.",
      "url": "https://checklandkindleysides.com/our-work/adidas-originals-bape-forum-gamified-retail-marketing-activation",
      "category": "footwear",
      "storeScope": "select",
      "promotionMethods": "Gamification, limited sneaker drops, END. UK exclusivity, BAPE camo branding, arcade nostalgia marketing, anti-bot physical experience"
    },
    {
      "id": 93,
      "brand": "Lululemon",
      "title": "Summer Run Club Series - Alpharetta",
      "date": "June 3 - August 19, 2024",
      "location": "Avalon, Alpharetta, GA",
      "description": "Six-week themed run club series partnering with The Hotel at Avalon and South City Kitchen. 45-minute coached runs on select Mondays covering Running 101, Injury Prevention, Goal Setting, Motivation, and Training Technique. Includes complimentary cocktails/mocktails and lululemon outfit giveaways.",
      "activation": "Weekly coached runs with Betsy Magato, themed educational workshops (6 topics), complimentary drinks on patio, lululemon outfit giveaways (3 weeks), injury prevention adjustments, meditation sessions, awards ceremony with perfect attendance staycation raffle.",
      "url": "https://www.awesomealpharetta.com/event/summer-run-club-series-powered-by-lululemon/2024-07-15/",
      "category": "apparel",
      "storeScope": "select",
      "promotionMethods": "Venue partnerships, run coach programming, themed educational content, outfit giveaways, complimentary refreshments, community building, perfect attendance incentives"
    },
    {
      "id": 94,
      "brand": "Patagonia",
      "title": "Worn Wear Snow Tour 2024 - Europe",
      "date": "Winter 2024 (Feb-March)",
      "location": "Europe (France, Italy, Germany, Austria, Switzerland, UK)",
      "description": "Mobile repair tour with two rolling repair shops visiting snow destinations including Chamonix, Innsbruck, Saalbach, Bormio, Trento, Montafon, Engelberg, and Andermatt. Offers free repairs on any brand of outdoor clothing - zippers, rips, tears, buttons. Hand-built wooden trailers with technical equipment, hot chocolate, and repair education.",
      "activation": "Free repairs on any brand (first-come-first-served), technical GORE-TEX repairs, repair education workshops teaching patching/waterproofing/zipper fixes, hand-crafted mobile trailers reaching remote locations, hot chocolate and community atmosphere, sustainability mission.",
      "url": "https://www.fall-line.co.uk/patagonia-worn-wear-tour/",
      "category": "apparel",
      "storeScope": "select",
      "promotionMethods": "Sustainability storytelling, free any-brand repairs, educational workshops, mobile touring, mountain resort partnerships, environmental mission marketing"
    },
    {
      "id": 95,
      "brand": "Nordstrom",
      "title": "Bode at The Corner - Flagship Pop-Up Series",
      "date": "March 14 - April 7, 2024",
      "location": "57th & Broadway, Nordstrom NYC Flagship",
      "description": "Launch of 'The Corner' - Nordstrom's 2,000 sq ft rotating pop-up series. First installation featuring Bode's men's and women's ready-to-wear, one-of-a-kind antique textile garments, hand-illustrated pieces. Opening event March 14 (6-8pm). Prices $198-2,200. Part of ongoing brand takeover series.",
      "activation": "Immersive brand-designed retail space, one-of-a-kind garment showcase, American craft tradition storytelling, opening cocktail event, authentic brand expression in Nordstrom flagship, first of rotating series (followed by Skims, Sanrio, Nike Running).",
      "url": "https://press.nordstrom.com/static-files/2377c5ba-b367-4a4f-8e4d-7e2fbfd235a4",
      "category": "apparel",
      "storeScope": "select",
      "promotionMethods": "Rotating brand takeovers, opening events, luxury positioning, exclusive one-of-a-kind pieces, NYC flagship destination, brand-designed spaces"
    }
  ]
}